//======================================== -*-tab-width:4-*- ==========//
/*!	@file
	@brief	ロゴ・クラス（ヘッダー）
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#ifndef LOGO_HPP
#define LOGO_HPP
#include <iostream>
#include <vector>
#include "gl_info.hpp"
#include "IScene.hpp"
#include "glmobj.hpp"
#include "intensity.hpp"
#include "button.hpp"

namespace core {

	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	/*!
		@brief	ロゴ・クラス
	*/
	//+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++//
	class logo : public IScene {

		gl::glmobj			m_mobj;
		gl::glmobj::handle	m_logo;
	    button m_button;
		gl::glmobj::handle	m_play;

		gl::intensity		m_inten;

		int					m_hold_time;

	public:
		//-----------------------------------------------------------------//
		/*!
			@brief	コンストラクター
		*/
		//-----------------------------------------------------------------//
	  logo() : m_logo(0), m_play(0), m_hold_time(0) { }


		//-----------------------------------------------------------------//
		/*!
			@brief	デストラクター
		*/
		//-----------------------------------------------------------------//
		virtual ~logo() { destroy(); }


		//-----------------------------------------------------------------//
		/*!
			@brief	ロゴ初期化
		 */
		//-----------------------------------------------------------------//
		void initialize();


		//-----------------------------------------------------------------//
		/*!
			@brief	シーン種別を取得（scene_info.hpp で規定）
			@return シーン種別
		 */
		//-----------------------------------------------------------------//
		scene_type get_scene_type() const { return render_logo; }


		//-----------------------------------------------------------------//
		/*!
			@brief	ロゴ・レンダリング
			@return 次の要求シーン・タイプ
		 */
		//-----------------------------------------------------------------//
		scene_type render();


		//-----------------------------------------------------------------//
		/*!
			@brief	ロゴ廃棄
		 */
		//-----------------------------------------------------------------//
		void destroy();

	};

}

#endif
