#ifndef SCENE_INFO_HPP
#define SCENE_INFO_HPP
//=====================================================================//
/*!	@file
	@brief	シーン情報
	@author	平松邦仁 (hira@rvf-rc45.net)
*/
//=====================================================================//
#include <iostream>

namespace core {

	//*****************************************************************//
	/*!
		@brief	シーン推移@n
				「シーン」毎の ID を規定する。@n
				新たな「シーン」を作成する場合、ここに ID を登録する
	*/
	//*****************************************************************//
	enum scene_type {
		continuance,		///< 継続（アイドル状態）
		error,				///< エラー状態

		render_logo,		///< ロゴ
		render_root_menu,   ///< メニュー

		mus_player,			///< MUSIC プレイヤー

	};

}

#endif
